In [1]:
# Import pandas and numpy libraries.
import pandas as pd
import numpy as np

In [2]:
# creating a series object (copied from 8_.. file bec'z im lazy)
sales1 = pd.Series([200, 300, 400, 500], index=['Facebook', 'Microsoft', 'Google', 'MyCompany'])
sales2 = pd.Series([250, 295, 470, 590], index=['Facebook', 'Microsoft', 'Google', 'MyCompany'])
sales3 = pd.Series([450, 305, 540, 650], index=['Facebook', 'Microsoft', 'Google', 'MyCompany'])

In [3]:
dataframe1 = pd.DataFrame({2017 : sales1, 2018 : sales2, 2019 : sales3})
dataframe1

           2017  2018  2019
Facebook    200   250   450
Microsoft   300   295   305
Google      400   470   540
MyCompany   500   590   650

In [4]:
# Accessing specific columns
dataframe1 [[2018, 2019]]

           2018  2019
Facebook    250   450
Microsoft   295   305
Google      470   540
MyCompany   590   650

In [7]:
# Accessing columns and rows
dataframe1[[2017, 2019]].head(3)

           2017  2019
Facebook    200   450
Microsoft   300   305
Google      400   540

In [9]:
# from last (tail())
dataframe1[[2017, 2019]].tail(3)

           2017  2019
Microsoft   300   305
Google      400   540
MyCompany   500   650

In [13]:
dataframe1[[2017, 2019]]

           2017  2019
Facebook    200   450
Microsoft   300   305
Google      400   540
MyCompany   500   650

In [14]:
# take only index specified in it.
dataframe1[[2017, 2019]].take([0,2])

          2017  2019
Facebook   200   450
Google     400   540

In [15]:
# checking type of object
dataframe1[[2017, 2019]].head(4)

           2017  2019
Facebook    200   450
Microsoft   300   305
Google      400   540
MyCompany   500   650

In [16]:
# type = pandas.core.frame.DataFrame
type (dataframe1[[2017, 2019]].head(4))

pandas.core.frame.DataFrame

In [17]:
dataframe1[[2017]].head(2)

           2017
Facebook    200
Microsoft   300

In [18]:
# type = pandas.core.frame.DataFrame
type(dataframe1[[2017]].head(2))

pandas.core.frame.DataFrame

In [19]:
dataframe1[2017].head(2)

Facebook     200
Microsoft    300
Name: 2017, dtype: int64

In [21]:
# type = pandas.core.series.Series 
type(dataframe1[2017].head(2)) # If you specified only one square bracket then it becomes Series object.

pandas.core.series.Series